Reports/ОтчетПоИзменениямВЗакрытомПериоде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>ОтчетПоИзменениямВЗакрытомПериоде</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ДатыЗапретаИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДатыЗапретаИзменения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.РазделыДатЗапретаИзменения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНазначенияДатЗапрета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыНазначенияДатЗапрета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДляВсехПользователей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВсемПользователям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВсемОбъектам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОтчетПоИзменениямВЗакрытомПериоде/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ	
	               |	ДатыЗапретаИзменения.ДатаЗапрета КАК ГлобальнаяДатаЗапрета
	               |ИЗ
	               |	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	               |ГДЕ
	               |	ДатыЗапретаИзменения.Объект = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ПоВсемОбъектам)
	               |	И ДатыЗапретаИзменения.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ПоВсемПользователям)";
	ГлобальныеДатыЗапрета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГлобальнаяДатаЗапрета");
	
	Элементы.ДатаЗапрета.СписокВыбора.Добавить('00010101', "За все время");
	Для Каждого ТекДата Из ГлобальныеДатыЗапрета Цикл
		Элементы.ДатаЗапрета.СписокВыбора.Добавить(ТекДата, Формат(ТекДата, "ДЛФ=DD"));
	КонецЦикла;		
	
	//ПараметрДата     = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата").Параметр;
	//ДоступныеЗначенияДаты = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(ПараметрДата).ДоступныеЗначения;
	//ДоступныеЗначенияДаты.Очистить();
	//Для Каждого ТекДата Из ГлобальныеДатыЗапрета Цикл
	//	ДоступныеЗначенияДаты.Добавить(ТекДата, Формат(ТекДата, "ДЛФ=DD"));
	//КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗапретаПриИзменении(Элемент)
	
	ПараметрСКД = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата");
	ПараметрСКД.Значение = ДатаЗапрета;
	ПараметрСКД.Использование = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
